/*
数据库： library_db;
表：
	用户表  user_table
    书籍表  book_table
*/


-- 1.book_table 创建
DROP DATABASE IF EXISTS library_db;
CREATE DATABASE library_db;
use library_db;
DROP TABLE IF EXISTS book;
SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

CREATE TABLE book(
	`book_id` int UNSIGNED NOT NULL COMMENT '书的id',
	`book_name` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '书名',
	`author` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '作者',
	`publishing_house` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '出版社',
	`year_of_publication` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '出版时间',
	`pages` int NULL DEFAULT NULL COMMENT '页数',
	`translator` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '译者',
	`ISBN` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT 'ISBN号码',
	`price` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '书的价钱',
	`score` float NULL DEFAULT NULL COMMENT '书的评分',
	`label` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL COMMENT '分类标签',
	PRIMARY KEY (`book_id`) USING BTREE
)ENGINE = MyISAM AUTO_INCREMENT = 1 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

INSERT INTO `book` VALUES (25862578, '解忧杂货店', '[日] 东野圭吾', '南海出版公司', '2014-5', 291, '李盈春', '9787544270878', '39.50元', 8.5, '东野圭吾/治愈/温暖/小说/日本/日本文学/東野圭吾/推理/');
INSERT INTO `book` VALUES (4913064, '活着', '余华', '作家出版社', '2012-8-1', 191, NULL, '9787506365437', '20.00元', 9.3, '余华/活着/人生/人性/中国文学/小说/社会/当代文学/');
INSERT INTO `book` VALUES (1770782, '追风筝的人', '[美] 卡勒德·胡赛尼', '上海人民出版社', '2006-5', 362, '李继宏', '9787208061644', '29.00元', 8.9, '追风筝的人/人性/救赎/阿富汗/小说/外国文学/卡勒德·胡赛尼/成长/');
INSERT INTO `book` VALUES (2567698, '三体', '刘慈欣', '重庆出版社', '2008-1', 302, NULL, '9787536692930', '23.00', 8.8, '科幻/刘慈欣/三体/科幻小说/中国科幻/中国/硬科幻/小说/');
INSERT INTO `book` VALUES (3259440, '白夜行', '[日] 东野圭吾', '南海出版公司', '2008-9', 467, '刘姿君', '9787544242516', '29.80元', 9.1, '東野圭吾/东野圭吾/推理/日本/悬疑/推理小说/日本文学/小说/');
INSERT INTO `book` VALUES (1084336, '小王子', '[法] 圣埃克苏佩里', '人民文学出版社', '2003-8', 97, '马振聘', '9787020042494', '22.00元', 9, '小王子/童话/经典/圣埃克苏佩里/法国/外国文学/哲学/成长/');
INSERT INTO `book` VALUES (27614904, '房思琪的初恋乐园', '林奕含', '北京联合出版公司', '2018-1', 272, NULL, '9787559614636', '45.00元', 9.2, '女性/林奕含/自我保护/女性/性别/台湾文学/小说/台湾/现代文学/');
INSERT INTO `book` VALUES (3211779, '嫌疑人X的献身', '[日] 东野圭吾', '南海出版公司', '2008-9', 251, '刘子倩', '9787544241694', '28.00', 8.9, '东野圭吾/推理/日本/推理小说/悬疑/東野圭吾/小说/日本文学/');
INSERT INTO `book` VALUES (30172069, '失踪的孩子', '[意] 埃莱娜·费兰特', '99读书人|人民文学出版社', '2018-7', 480, '陈英', '9787020139927', '62.00元', 9.2, '那不勒斯四部曲/小说/女性/外国文学/意大利文学/埃莱娜•费兰特/意大利/埃莱娜·费兰特/');
INSERT INTO `book` VALUES (1008145, '围城', '钱锺书', '人民文学出版社', '1991-2', 359, NULL, '9787020024759', '19.00', 8.9, '钱钟书/围城/中国文学/小说/经典/婚姻/现代文学/文学/');
INSERT INTO `book` VALUES (6082808, '百年孤独', '[哥伦比亚] 加西亚·马尔克斯', '南海出版公司', '2011-6', 360, '范晔', '9787544253994', '39.50元', 9.2, '百年孤独/加西亚·马尔克斯/经典/拉美文学/外国文学/小说/魔幻现实主义/文学/');
INSERT INTO `book` VALUES (1200840, '平凡的世界（全三部）', '路遥', '人民文学出版社', '2005-1', 1631, NULL, '9787020049295', '64.00元', 9, '平凡的世界/路遥/中国文学/小说/人生/经典/文学/当代/');
INSERT INTO `book` VALUES (3266609, '流浪地球', '刘慈欣', '湖北长江出版集团，长江文艺出版社', '2008-11', 293, NULL, '9787535438379', '28.00元', 8.6, '刘慈欣/科幻/科幻小说/中国科幻/小说/中国/硬科幻/大刘/');
INSERT INTO `book` VALUES (1007305, '红楼梦', '高鹗 续', '人民文学出版社', '1996-12', 1606, NULL, '9787020002207', '59.70元', 9.6, '红楼梦/古典文学/曹雪芹/经典/古典名著/小说/名著/中国/');
INSERT INTO `book` VALUES (26954760, '月亮与六便士', '[英] 威廉·萨默塞特·毛姆', '浙江文艺出版社', '2017-1-1', 304, '徐淳刚', '9787533936020', '39.80元', 8.8, '毛姆/月亮与六便士/经典/外国文学/小说/英国/文学/英国文学/');
INSERT INTO `book` VALUES (26878124, '我的天才女友', '[意] 埃莱娜·费兰特', '人民文学出版社', '2017-1', 330, '陈英', '9787020120130', '42.00元', 8.5, '小说/女性友谊/埃莱娜·费兰特/外国文学/女性/意大利文学/意大利/那不勒斯四部曲/');
INSERT INTO `book` VALUES (10594787, '霍乱时期的爱情', '[哥伦比亚] 加西亚·马尔克斯', '南海出版公司', '2012-9-1', 401, '杨玲', '9787544258975', '39.50元', 9, '霍乱时期的爱情/加西亚-马尔克斯/爱情/小说/加西亚·马尔克斯/拉美文学/外国文学/文学/');
INSERT INTO `book` VALUES (5363767, '三体Ⅲ', '刘慈欣', '重庆出版社', '2010-11', 513, NULL, '9787229030933', '38.00元', 9.2, '科幻/刘慈欣/三体/中国科幻/小说/科幻小说/硬科幻/中国/');
INSERT INTO `book` VALUES (1029791, '许三观卖血记', '余华', '南海出版公司', '1998-9', 269, NULL, '9787544211765', '16.80元', 8.7, '余华/许三观卖血记/小说/中国文学/人生/当代/人性/文学/');
INSERT INTO `book` VALUES (10554308, '白夜行', '东野圭吾', '南海出版公司', '2013-1-1', 538, '刘姿君', '9787544258609', 'CNY 39.50', 9.2, '东野圭吾/悬疑推理/日系推理/推理/日本文学/日本/小说/模糊式爱情/');
INSERT INTO `book` VALUES (1046265, '挪威的森林', '[日] 村上春树', '上海译文出版社', '2001-2', 350, '林少华', '9787532725694', '18.80元', 8, '村上春树/挪威的森林/日本文学/小说/日本/爱情/青春/外国文学/');
INSERT INTO `book` VALUES (3066477, '三体Ⅱ', '刘慈欣', '重庆出版社', '2008-5', 470, NULL, '9787536693968', '32.00', 9.3, '科幻/刘慈欣/三体/科幻小说/小说/黑暗森林/中国/中国科幻/');
INSERT INTO `book` VALUES (4011670, '人间失格', '太宰治', '吉林出版集团有限责任公司', '2009年9月', 168, '许时嘉', '9787546302393', '16.00元', 8.3, '太宰治/日本文学/人间失格/日本/人性/小说/文学/无赖派/');
INSERT INTO `book` VALUES (1016003, '鲁滨逊漂流记', '[英] 笛福', '广西民族出版社', '2002-1', 209, '马静', '9787536340497', '9.20元', 8, '鲁滨逊漂流记/外国文学/小说/笛福/经典/英国/名著/外国名著/');
INSERT INTO `book` VALUES (1057244, '边城', '黄永玉 卓雅 插图.', '北岳文艺出版社', '2002-4', 174, NULL, '9787537823425', '12.00元', 8.6, '沈从文/边城/乡土/中国文学/小说/经典/文学/现代文学/');
INSERT INTO `book` VALUES (1873231, '明朝那些事儿（壹）', '当年明月', '中国友谊出版公司', '2006-9', 298, NULL, '9787505722460', '24.80', 8.7, '历史/明朝那些事儿/当年明月/明朝/中国历史/明史/小说/朱元璋/');
INSERT INTO `book` VALUES (4820710, '1984', '[英] 乔治·奥威尔', '北京十月文艺出版社', '2010-4-1', 304, '刘绍铭', '9787530210291', '28.00', 9.3, '反乌托邦/乔治·奥威尔/政治/1984/小说/政治寓言/外国文学/英国/');
INSERT INTO `book` VALUES (1043815, '骆驼祥子', '老舍', '人民文学出版社', '2000-3-1', 224, NULL, '9787020028115', '12.00', 8.3, '老舍/中国文学/骆驼祥子/小说/经典/社会/名著/现代文学/');
INSERT INTO `book` VALUES (26382433, '无声告白', '[美] 伍绮诗', '江苏凤凰文艺出版社', '2015-7', 293, '孙璐', '9787539982830', '35.00元', 8.2, '小说/成长/好书，值得一读/华裔/美国文学/外国文学/美国/伍绮诗/');
INSERT INTO `book` VALUES (1948901, '盗墓笔记', '南派三叔', '中国友谊出版公司', '2007-1', 265, NULL, '9787505722835', '26.80元', 8.3, '盗墓笔记/南派三叔/盗墓/小说/悬疑/惊悚/网络小说/中国/');
INSERT INTO `book` VALUES (1041007, '哈利·波特与魔法石', '[英] J. K. 罗琳', '人民文学出版社', '2000-9', 191, '苏农', '9787020033430', '19.50元', 9, '哈利波特/J.K.罗琳/魔幻/小说/英国/外国文学/哈利・波特/哈利·波特/');
INSERT INTO `book` VALUES (1022060, '狼图腾', '姜戎', '长江文艺出版社', '2004-4', 408, NULL, '9787535427304', '32.00元', 8.2, '狼图腾/小说/草原/狼/姜戎/中国文学/文化/图腾/');
INSERT INTO `book` VALUES (1040771, '达·芬奇密码', '[美] 丹·布朗', '上海人民出版社', '2004-2', 432, '周元晓', '9787208050037', '28.00元', 8.2, '悬疑/达・芬奇密码/小说/推理/宗教/丹・布朗/外国文学/丹·布朗/');
INSERT INTO `book` VALUES (1083428, '傲慢与偏见', '[英] 奥斯丁', '人民文学出版社', '1993-7', 310, '张扬', '9787020040179', '13.00元', 8.8, '傲慢与偏见/奥斯丁/外国文学/爱情/经典/小说/英国/外国名著/');
INSERT INTO `book` VALUES (3646172, '恶意', '[日] 东野圭吾', '南海出版公司', '2009-6', 264, '娄美莲', '9787544244428', '18.00', 8.4, '东野圭吾/推理/日本/推理小说/東野圭吾/悬疑/小说/日本文学/');
INSERT INTO `book` VALUES (1082334, '穆斯林的葬礼', '霍达', '北京十月文艺出版社', '1988-12-1', 750, NULL, '9787530201244', '32.00', 8.2, '穆斯林的葬礼/小说/霍达/宗教/中国文学/爱情/穆斯林/经典/');
INSERT INTO `book` VALUES (30316475, '漫长的告别', '[美] 雷蒙德·钱德勒', '海南出版社', '2018-9', 432, '姚向辉', '9787544384636', '69.00', 8.4, '雷蒙德·钱德勒/好书，值得一读/外国文学/小说/经典/悬疑/想读，一定很精彩！/侦探马洛/');
INSERT INTO `book` VALUES (1064275, '老人与海', '海明威', '上海译文出版社', '1999-10', 104, '吴劳', '9787532723447', '8.20元', 8.3, '海明威/老人与海/外国文学/经典/小说/美国/名著/外国名著/');
INSERT INTO `book` VALUES (30254236, '4 3 2 1', '[美] 保罗·奥斯特', '理想国丨九州出版社', '2019-1', 840, '李鹏程', '9787510872662', '148.00', 8.8, '保罗·奥斯特/小说/美国文学/外国文学/理想国/文学/美国/PaulAuster/');
INSERT INTO `book` VALUES (1085799, '白鹿原', '陈忠实', '人民文学出版社', '1997-12', 677, NULL, '9787020026906', '28.00元', 8.7, '陈忠实/白鹿原/小说/中国文学/茅盾文学奖/农村/文学/中国/');
INSERT INTO `book` VALUES (1068920, '飘', '[美国] 玛格丽特·米切尔', '译林出版社', '2000-9', 1235, '李美华', '9787806570920', '40.00元', 9.3, '飘/外国文学/经典/爱情/小说/外国名著/美国/名著/');
INSERT INTO `book` VALUES (26986954, '新名字的故事', '[意] 埃莱娜·费兰特', '人民文学出版社', '2017-4', 492, '陈英', '9787020125265', '59.00元', 9, '女性/那不勒斯四部曲/小说/埃莱娜•费兰特/外国文学/意大利文学/意大利/文学/小说/');
INSERT INTO `book` VALUES (11524204, '围城', '钱钟书', '人民文学出版社', '1991-2-1', 362, NULL, '9787020090006', '39.00元', 9.2, '钱钟书/经典/围城/婚姻/中国文学/钱锺书/中国现当代文学/小说/');
INSERT INTO `book` VALUES (1141406, '简爱（英文全本）', '[英] 夏洛蒂·勃朗特', '世界图书出版公司', '2003-11', 436, NULL, '9787506261579', '18.00元', 8.5, '简爱/外国文学/经典/爱情/小说/名著/英国/外国名著/');
INSERT INTO `book` VALUES (4242172, '天才在左 疯子在右', '高铭', '武汉大学出版社', '2010-2', 258, NULL, '9787307075429', '29.80元', 8.1, '心理学/精神病学/心理/哲学/精神病/社会学/高铭/量子物理/');
INSERT INTO `book` VALUES (1017143, '不能承受的生命之轻', '[捷克] 米兰·昆德拉', '上海译文出版社', '2003-7', 394, '许钧', '9787532731077', '23.00元', 8.5, '米兰・昆德拉/不能承受的生命之轻/外国文学/小说/哲学/捷克/米兰·昆德拉/文学/');
INSERT INTO `book` VALUES (4908885, '局外人', '[法] 阿尔贝·加缪', '上海译文出版社', '2010-9', 128, '柳鸣九', '9787532751471', '22.00元', 9, '加缪/存在主义/法国/小说/外国文学/局外人/法国文学/阿尔贝·加缪/');
INSERT INTO `book` VALUES (6781808, '杀死一只知更鸟', '[美] 哈珀·李', '译林出版社', '2012-9', 346, '高红梅', '9787544722766', '32.00元', 9.2, '杀死一只知更鸟/成长/美国文学/小说/经典/教育/外国文学/哈珀·李/');
INSERT INTO `book` VALUES (26698660, '巨人的陨落', '[英] 肯·福莱特', '江苏凤凰文艺出版社', '2016-5-1', 1168, '于大卫', '9787539989891', '129.80元', 8.9, '历史/小说/外国文学/肯·福莱特/好书，值得一读/经典/英国小说/英国/');
INSERT INTO `book` VALUES (1019568, '三国演义（全二册）', '[明] 罗贯中', '人民文学出版社', '1998-05', 990, NULL, '9787020008728', '39.50元', 9.2, '三国演义/古典文学/小说/古典名著/罗贯中/名著/历史/中国/');
INSERT INTO `book` VALUES (30366534, '熊镇', '[瑞典] 弗雷德里克·巴克曼', '四川文艺出版社', '2018-12', 400, '郭腾坚', '9787541149337', '45', 8.1, '弗雷德里克·巴克曼/小说/外国文学/瑞典文学/瑞典/文学/好书，值得一读/喜欢的一本书/');
INSERT INTO `book` VALUES (1090043, '倾城之恋', NULL, '花城出版社', '1997-3-1', 284, NULL, '9787536023918', '11.00', 8.5, '张爱玲/倾城之恋/爱情/小说/中国文学/经典/張愛玲/文学/');
INSERT INTO `book` VALUES (26340138, '岛上书店', '[美] 加·泽文', '江苏凤凰文艺出版社', '2015-5-1', 271, '李玉瑶', '9787539971810', 'CNY 35.00', 7.6, '小说/外国文学/心灵/好书，值得一读/美国文学/生活/文学/美国/');
INSERT INTO `book` VALUES (3608208, '牧羊少年奇幻之旅', '[巴西]保罗·柯艾略', '南海出版公司', '2009-3-1', 217, '丁文林', '9787544244190', '25.00元', 8.6, '牧羊少年奇幻之旅/保罗柯艾略/外国文学/小说/与心沟通/童话/巴西/成长/');
INSERT INTO `book` VALUES (1008988, '了不起的盖茨比', '菲茨杰拉德', '人民文学出版社', '2004-06', 192, '姚乃强', '9787020046089', '12.00元', 8.3, '了不起的盖茨比/菲茨杰拉德/美国/小说/外国文学/经典/名著/文学/');
INSERT INTO `book` VALUES (27193117, '我们一无所有', '[美] 安东尼·马拉', '江苏凤凰文艺出版社', '2018-2', 332, '施清真', '9787559413727', '49.80', 8.8, '外国文学/小说/安东尼·马拉/文学/长篇小说/经典/美国/2018/');
INSERT INTO `book` VALUES (27611824, '如父如子', '[日] 佐野晶', '湖南文艺出版社', '2018-4', 304, '丹勇', '9787540484651', '49.80', 8.9, '是枝裕和/日本文学/亲情/日本/小说/生活/日@是枝裕和/外国文学/');
INSERT INTO `book` VALUES (1089243, '黄金时代', '王小波', '花城出版社', '1999-3', 375, NULL, '9787536025080', '19.00元', 8.8, '王小波/黄金时代/小说/中国文学/经典/当代/文学/中国/');
INSERT INTO `book` VALUES (2154960, '一个陌生女人的来信', '[奥] 斯台芬·茨威格', '上海译文出版社', '2007-7', 340, '张玉书', '9787532741571', '20.00元', 8.7, '茨威格/一个陌生女人的来信/爱情/外国文学/小说/奥地利/经典/文学/');
INSERT INTO `book` VALUES (3006581, '无人生还', '[英] 阿加莎・克里斯蒂', '人民文学出版社', '2008-3', 254, '祁阿红', '9787020065394', '19.00', 8.9, '阿加莎·克里斯蒂/推理/悬疑推理/英国/小说/侦探推理/无人生还/外国文学/');
INSERT INTO `book` VALUES (30362170, '冬泳', '班宇', '理想国丨上海三联书店', '2018-11', 308, NULL, '9787542664051', '49.00元', 8.4, '小说/班宇/中国现当代文学/短篇小说/东北/文学/理想国/黑色幽默/');
INSERT INTO `book` VALUES (1013380, '茶花女', '小仲马', '外国文学出版社', '1997-3', 272, '王振孙', '9787501600069', '9.00元', 8.2, '小仲马/茶花女/外国文学/爱情/法国/小说/经典/名著/');
INSERT INTO `book` VALUES (1400705, '情人', '[法] 玛格丽特·杜拉斯', '上海译文出版社', '2005-7', 146, '王道乾', '9787532736874', '20.00元', 8.1, '杜拉斯/情人/法国/小说/外国文学/爱情/玛格丽特・杜拉斯/玛格丽特·杜拉斯/');
INSERT INTO `book` VALUES (30128204, '莫斯科绅士', '[美]埃默·托尔斯', '博集天卷 | 湖南文艺出版社', '2018-6', 592, '马韧', '9787540485528', '79.80', 8.8, '外国文学/俄罗斯/小说/埃默·托尔斯/文学/人生/高贵人格/美国/');
INSERT INTO `book` VALUES (27204805, '那不勒斯故事四部曲', '艾琳娜.斐蘭德', '大塊文化', NULL, NULL, '李靜宜', '9789862138533', NULL, 9.2, '那不勒斯四部曲/女性/意大利文学/埃莱娜•费兰特/小说/人生观/外国文学/文学/');
INSERT INTO `book` VALUES (27104959, '离开的，留下的', '[意] 埃莱娜·费兰特', '人民文学出版社', '2017-10', 492, '陈英', '9787020132003', '62.00', 8.7, '那不勒斯四部曲/女性/埃莱娜·费兰特/小说/意大利/意大利文学/外国文学/文学/');
INSERT INTO `book` VALUES (1254588, '城南旧事', '关维兴 图', '中国青年出版社', '2003-7', 198, NULL, '9787500652045', '16.00元', 9, '林海音/城南旧事/童年/中国文学/小说/小时候/儿童文学/文学/');
INSERT INTO `book` VALUES (1003000, '悟空传', '今何在', '光明日报出版社', '2001-4', 300, NULL, '9787801453648', '14.80元', 8.4, '悟空传/今何在/小说/网络小说/网络文学/西游记/中国/文学/');
INSERT INTO `book` VALUES (1829226, '肖申克的救赎', '[美] 斯蒂芬·金', '人民文学出版社', '2006-7', 466, '齐若兰', '9787020054985', '29.90元', 9.1, '肖申克的救赎/斯蒂芬·金/小说/外国文学/经典/希望/美国/悬疑/');
INSERT INTO `book` VALUES (1085860, '基督山伯爵', '大仲马', '上海译文出版社', '1991-12-1', 1453, '韩沪麟', '9787532712243', '43.90元', 9, '大仲马/基督山伯爵/外国文学/复仇/经典/小说/法国/名著/');
INSERT INTO `book` VALUES (1361264, '撒哈拉的故事', '三毛', '皇冠出版社', '1976', 240, NULL, '9789573305545', '160 TWD', 9, '三毛/撒哈拉的故事/旅行/散文/随笔/文学/台湾/爱情/');
INSERT INTO `book` VALUES (27608412, '默读', 'Priest', '百花洲文艺出版社', '2018-1', 344, NULL, '9787550025103', '45.00', 8.5, 'priest/耽美/犯罪/悬疑/人性/心理/小说/救赎/');
INSERT INTO `book` VALUES (1071241, '哈利·波特与阿兹卡班的囚徒', '[英] J. K. 罗琳', '人民文学出版社', '2000-9', 259, '郑须弥', '9787020033454', '26.50元', 8.9, '哈利波特/J.K.罗琳/魔幻/小说/英国/哈利·波特/外国文学/HarryPotter/');
INSERT INTO `book` VALUES (30254298, '云边有个小卖部', '张嘉佳', '湖南文艺出版社', '2018-7', 328, NULL, '9787540487645', '42.00元', 8, '张嘉佳/治愈/故乡/情感/好书，值得一读/小说/生活/文学/');
INSERT INTO `book` VALUES (2159042, '挪威的森林', '[日] 村上春树', '上海译文出版社', '2007-7', 384, '林少华', '9787532742929', '23.00元', 8.5, '村上春树/日本文学/挪威的森林/日本/小说/青春/爱情/孤独/');
INSERT INTO `book` VALUES (2035179, '动物农场', '[英] 乔治·奥威尔', '上海译文出版社', '2007-3', 119, '荣如德', '9787532741854', '10.00元', 9.2, '乔治·奥威尔/政治寓言/小说/极权主义/外国文学/英国/政治/反乌托邦/');
INSERT INTO `book` VALUES (1039487, '哈利·波特与密室', '[英] J. K. 罗琳', '人民文学出版社', '2000-9', 203, '马爱新', '9787020033447', '22.00元', 8.9, '哈利波特/J.K.罗琳/魔幻/小说/英国/哈利·波特/外国文学/HarryPotter/');
INSERT INTO `book` VALUES (1082154, '活着', '余华', '南海出版公司', '1998-5', 195, NULL, '9787544210966', '12.00元', 9.1, '余华/活着/小说/中国文学/人生/生活/文学/当代/');
INSERT INTO `book` VALUES (1827374, '东方快车谋杀案', '[英] 阿加莎·克里斯蒂', '人民文学出版社', '2006-5', 254, '陈尧光', '9787020056309', '18.00元', 9, '阿加莎·克里斯蒂/推理/英国/推理小说/侦探/小说/侦探推理/东方快车谋杀案/');
INSERT INTO `book` VALUES (1205370, '羊脂球', '（法）莫泊桑', '北京燕山出版社', '2007-6', 281, '柳鸣九', '9787540211998', '13.50元', 8.1, '莫泊桑/外国文学/羊脂球/小说/法国/经典/名著/外国名著/');
INSERT INTO `book` VALUES (1024197, '巴黎圣母院', '[法]雨果', '人民文学出版社', '1982-6', 568, '陈敬容', '9787020032044', '22.50元', 8.3, '雨果/巴黎圣母院/外国文学/法国/小说/经典/名著/外国名著/');
INSERT INTO `book` VALUES (26356948, '摆渡人', '[英]克莱儿·麦克福尔', '百花洲文艺出版社', '2015-6-1', 280, '付强', '9787550013247', '36.00', 6.2, '治愈系/摆渡人/心灵成长/小说/爱情/外国文学/好书，值得一读/心灵/');
INSERT INTO `book` VALUES (26899537, '长安十二时辰', '马伯庸', '湖南文艺出版社', '2017-1', 656, NULL, '9787540478315', 'CNY 79.60', 8.5, '马伯庸/小说/悬疑/历史/唐朝/长安十二时辰/鬼才之思/架空小说/');
INSERT INTO `book` VALUES (1009257, '哈利·波特与火焰杯', '[英] J. K. 罗琳', '人民文学出版社', '2001-5', 433, '马爱新', '9787020034635', '39.80元', 9, '哈利波特/J.K.罗琳/魔幻/小说/英国/哈利・波特/外国文学/HarryPotter/');
INSERT INTO `book` VALUES (1085470, '海底两万里', '[法国] 儒尔·凡尔纳', '译林出版社', '2002-9', 414, '曹德明', '9787806574317', '19.50元', 8.4, '科幻/凡尔纳/海底两万里/儒勒·凡尔纳/科幻小说/外国文学/小说/法国/');
INSERT INTO `book` VALUES (10763902, '偷影子的人', '(法)马克·李维', '湖南文艺出版社', '2012-6-20', 227, '段韵灵', '9787540455958', '29.80元', 7.8, '小说/马克李维/法国/小清新/治愈/法国文学/温情/外国文学/');
INSERT INTO `book` VALUES (24934182, '一个人的朝圣', '【英】蕾秋·乔伊斯', '北京联合出版公司', '2013-9-1', 320, '黄妙瑜', '9787550213524', '32.80', 8.1, '一个人的朝圣/自我发现/小说/心灵/旅行/英国文学/外国文学/人生/');
INSERT INTO `book` VALUES (30374817, '小偷家族', '[日] 是枝裕和', '北京联合出版公司', '2019-1', 280, '赵仲明', '9787559610935', '45.00', 8.6, '是枝裕和/日本文学/小偷家族/日本/电影原著/小说/日本小说/文学/');
INSERT INTO `book` VALUES (1882933, '鬼吹灯之精绝古城', '天下霸唱', '安徽文艺出版社', '2006', 257, NULL, '9787539628042', '25.00元', 8.1, '盗墓/鬼吹灯/小说/天下霸唱/探险/灵异/网络小说/奇幻/');
INSERT INTO `book` VALUES (1119522, '呼啸山庄', '张扬', '人民文学出版社', '1999-01-01', 399, '张玲', '9787020027606', '27.30元', 8.4, '呼啸山庄/外国文学/小说/经典/英国/名著/爱情/外国名著/');
INSERT INTO `book` VALUES (1007914, '窗边的小豆豆', '岩崎千弘 图', '南海出版公司', '2003-1', 288, '赵玉皎', '9787544222976', '20.00元', 8.7, '窗边的小豆豆/黑柳彻子/儿童文学/日本/教育/童年/日本文学/儿童/');
INSERT INTO `book` VALUES (3803820, '人生', '路遥', '北京十月文艺出版社', '2009-5', 225, NULL, '9787530209578', '20.00元', 8.4, '路遥/人生/小说/命运/中国文学/当代文学/经典/文学/');
INSERT INTO `book` VALUES (1449351, '呐喊', '鲁迅', '人民文学出版社', '1973年3月', 160, NULL, NULL, '0.36元', 8.9, '鲁迅/中国文学/呐喊/小说/经典/杂文/文学/中国/');
INSERT INTO `book` VALUES (1255625, '天龙八部', '金庸', '三联书店', '1994-5', 1978, '有1996年11月北平第4次印刷本', '9787108006721', '96.0', 9.1, '金庸/武侠/天龙八部/小说/武侠小说/经典/中国文学/中国/');
INSERT INTO `book` VALUES (30390651, '时间的礼物', '[瑞典] 弗雷德里克·巴克曼', '天津人民出版社', '2019-1-1', 64, '孙璐', '9787201142821', '36.00元', 7.6, '弗雷德里克·巴克曼/小说/外国文学/时间/瑞典文学/2019/温馨催泪/瑞典/');
INSERT INTO `book` VALUES (1014278, '红玫瑰与白玫瑰', '张爱玲', '花城出版社', '1996-06', 314, NULL, '9787536021440', '12.80元', 8.4, '张爱玲/红玫瑰与白玫瑰/小说/爱情/中国文学/经典/張愛玲/文学/');
INSERT INTO `book` VALUES (30164967, '知否知否应是绿肥红瘦', '关心则乱', '中国华侨出版社', '2018-4-1', 304, NULL, '9787511373335', '42', 7.4, '小说/种田/古言/关心则乱/为人处事/言情/穿越/赵丽颖/');
INSERT INTO `book` VALUES (1013129, '哈利·波特与凤凰社', '[英] J. K. 罗琳', '人民文学出版社', '2003-9', 575, '蔡文', '9787020043279', '59.00元', 8.7, '哈利波特/J.K.罗琳/魔幻/小说/英国/哈利・波特/外国文学/HarryPotter/');
INSERT INTO `book` VALUES (2295163, '哈利·波特与死亡圣器', '[英] J. K. 罗琳', '人民文学出版社', '2007-10', 574, '马爱新', '9787020063659', '66.00元', 9, '哈利波特/J.K.罗琳/魔幻/小说/英国/HarryPotter/哈利·波特/外国文学/');
INSERT INTO `book` VALUES (30325325, '全能侦探社', '[英] 道格拉斯·亚当斯', '浦睿文化·湖南文艺出版社', '2019-1', 296, '姚向辉', '9787540488505', '49.00元', 8.5, '推理/科幻/道格拉斯·亚当斯/小说/科幻小说/全能侦探社/英国/外国文学/');
INSERT INTO `book` VALUES (30224833, '圣殿春秋', '[英] 肯·福莱特', '江苏凤凰文艺出版社', '2018-7', 1352, '胡允桓', '9787559420602', '188元', 8.6, '肯·福莱特/外国文学/好书，值得一读/小说/历史/英国文学/想读，一定很精彩！/文学/');
INSERT INTO `book` VALUES (1088065, '阿Q正传', '丰子恺', '上海书店出版社', '2003-7', 189, NULL, '9787806222850', '14.50元', 8.7, '鲁迅/阿Q正传/中国文学/小说/经典/现代文学/中国/文学/');
INSERT INTO `book` VALUES (1432596, '哈利·波特与混血王子', '[英] J. K. 罗琳', '人民文学出版社', '2005-10', 496, '马爱新', '9787020053230', '58.00元', 8.8, '哈利波特/J.K.罗琳/魔幻/小说/英国/外国文学/哈利・波特/哈利·波特/');
INSERT INTO `book` VALUES (10517238, '平凡的世界', '路遥', '北京出版集团公司,北京十月文艺出版社', '2012-3-1', 1251, NULL, '9787530212004', 'CNY 79.80', 9, '路遥/平凡的世界/中国文学/经典/人生/小说/茅盾文学奖/文学/');
INSERT INTO `book` VALUES (4074636, '放学后', '[日]东野圭吾', '南海出版公司', '2010-1', 215, '赵峻', '9787544245517', '20.00', 7.6, '东野圭吾/推理/日本/小说/東野圭吾/推理小说/日本文学/悬疑/');
INSERT INTO `book` VALUES (1045818, '苏菲的世界', '（挪威）乔斯坦·贾德', '作家出版社', '1999-04', 535, '萧宝森', '9787506309745', '26.80元', 8.5, '哲学/哲学入门/苏菲的世界/启蒙/乔斯坦·贾德/外国文学/小说/挪威/');
INSERT INTO `book` VALUES (1002299, '笑傲江湖（全四册）', '金庸', '生活·读书·新知三联书店', '1994-5', 1599, NULL, '9787108006639', '76.80元', 9, '金庸/武侠/笑傲江湖/小说/武侠小说/经典/中国文学/中国/');
INSERT INTO `book` VALUES (30155720, '小小小小的火', '[美] 伍绮诗', '江苏凤凰文艺出版社', '2018-4', 400, '孙璐', '9787559407399', '52.00元', 8.4, '伍绮诗/小说/成长/外国文学/美国文学/文学/美国亚马逊年度图书/征服欧美文坛的华裔作家/');
INSERT INTO `book` VALUES (30142261, '长日将尽', '[英] 石黑一雄', '上海译文出版社', '2018-5', 337, '冯涛', '9787532777532', '48.00元', 8.9, '石黑一雄/诺贝尔奖/小说/英国文学/日本/英国/长篇小说/外国文学/');
INSERT INTO `book` VALUES (30415612, '夏摩山谷', '庆山', '江苏凤凰文艺出版社', '2019-1', 400, NULL, '9787559431523', '58.00元', 7.2, '庆山/安妮宝贝/小说/作者/安妮宝贝/2019/中国近现代文学/中国/华语/');
INSERT INTO `book` VALUES (1080370, '情书', '[日] 岩井俊二', '天津人民出版社', '2004-7', 256, '穆晓芳', '9787201048161', '18.00元', 8.6, '岩井俊二/情书/日本/爱情/日本文学/小说/日本小说/青春/');
INSERT INTO `book` VALUES (2035162, '刀锋', '[英]毛姆', '上海译文出版社', '2007-3', 318, '周煦良', '9787532741922', '18.00元', 9, '毛姆/小说/英国/外国文学/英国文学/刀锋/经典/文学/');
INSERT INTO `book` VALUES (1858513, '月亮和六便士', '[英] 毛姆', '上海译文出版社', '2006-8', 275, '傅惟慈', '9787532739547', '15.00元', 9, '毛姆/月亮和六便士/小说/外国文学/英国/英国文学/毛姆：月亮和六便士/文学/');
INSERT INTO `book` VALUES (1029553, '西游记（全二册）', '吴承恩', '人民文学出版社', '2004-8', 1198, '黄肃秋 注释', '9787020008735', '47.20元', 8.8, '古典文学/西游记/小说/古典名著/名著/中国/中国文学/经典/');
INSERT INTO `book` VALUES (2143732, '灿烂千阳', '[美] 卡勒德·胡赛尼', '上海人民出版社', '2007-9', 428, '李继宏', '9787208072107', '28.00元', 8.8, '卡勒德·胡塞尼/阿富汗/灿烂千阳/女性/小说/外国文学/苦难/卡勒德·胡赛尼/');
INSERT INTO `book` VALUES (1040211, '福尔摩斯探案全集（上中下）', '[英] 阿·柯南道尔', '群众出版社', '1981-8', NULL, '丁钟华 等', '9787501408580', '53.00元/68.00元', 9.2, '福尔摩斯/推理/侦探/柯南道尔/侦探小说/经典/小说/英国/');
INSERT INTO `book` VALUES (26425831, '斯通纳', '[美] 约翰·威廉斯', '世纪文景/上海人民出版社', '2016-1', 336, '杨向荣', '9787208130500', '39.00元', 8.8, '小说/人生/美国文学/约翰·威廉斯/外国文学/美国/文学/理想/');

SET FOREIGN_KEY_CHECKS = 1;
use library_db;
ALTER TABLE book RENAME TO book_table;
-- end of book_table


-- 2.user_table 创建
use library_db;
DROP TABLE IF EXISTS user_table;

CREATE TABLE user_table(
	`user_id` INT UNSIGNED NOT NULL COMMENT '用户id',
    `user_password` VARCHAR(32) NOT NULL COMMENT '用户密码',
	`user_phone` BIGINT UNSIGNED NULL COMMENT '用户手机号码',
    `faculty_id` INTEGER UNSIGNED NULL COMMENT '读者学号or工号',
    `reader_state` TINYINT NOT NULL DEFAULT 0 COMMENT '读者身份状态',
    `reader_name` VARCHAR (32) NULL COMMENT '读者昵称',
	PRIMARY KEY (`user_id`)
)

INSERT INTO user_table VALUES (8888, 'tsg', NULL, NULL, 1, NULL);  -- 管理员账号
INSERT INTO user_table VALUES (6666, 'xjh', 19452321766, 162230306, 1, '相见欢');
INSERT INTO user_table VALUES (6, '6',666, NULL, 1, NULL);
INSERT INTO user_table VALUES (123456, 'tgcf666', 16278913605, 991600163, 0, '阿正');
INSERT INTO user_table VALUES (3191910383, 'xueyutanhua', 17661945232, 232323333, 1, '23333');
-- end of user_table


-- 给book_table添加新字段bstate，表示剩余量，默认为1
use library_db;
ALTER TABLE book_table ADD bstate INT DEFAULT 1;

